Source/wgo-vmoksha/Wgo.RoR/app/controllers/users_controller.rb

  def index
    @offset, @limit = api_offset_and_limit
    @users =  User.find :all,
                        :limit  =>  @limit,
                        :offset =>  @offset
---
SELECT "users".* FROM "users" LIMIT 25 OFFSET 0

  def saveUser
     @user = User.find(params[:id])
     @user.update_attributes(:userName => params[:userName], :password => params[:password], :email => params[:email] )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", ""]]
UPDATE "users" SET "username" = 'asdasdasd', "updated_at" = '2012-08-13 12:44:01.031398' WHERE "users"."id" = 7