trunk/Source/wgo-vmoksha/Wgo.RoR/app/controllers/festivals_controller.rb

  def index
    @festivals =  Festival.find :all
---
SELECT "festivals".* FROM "festivals"