trunk/Source/wgo-vmoksha/Wgo.RoR/app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 25 OFFSET 0
---
  def index
    @offset, @limit = api_offset_and_limit
    @users =  User.find :all,
                        :limit  =>  @limit,
                        :offset =>  @offset

INSERT INTO "users" ("created_at", "email", "password", "updated_at", "userName") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 11 Aug 2012 09:28:59 UTC +00:00], ["email", "sk@vm.com"], ["password", "senthil"], ["updated_at", Sat, 11 Aug 2012 09:28:59 UTC +00:00], ["userName", "senthil"]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE (:userName => 'params[:userName]' AND :password = 'params[:password]')
---
  def authenticate
     usr = params[:userName]
     pwd = params[:password]
     @getUser = User.where("userName = ? AND password = ?", params[:userName], params[:password])